
Процедура ПеренестиДокументПосещаемостьНаНужнуюДату() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Посещаемость.Ссылка КАК Ссылка,
	|	Посещаемость.Дата КАК Дата,
	|	Посещаемость.ВместоКакойДаты КАК ВместоКакойДаты
	|ИЗ
	|	Документ.Посещаемость КАК Посещаемость
	|ГДЕ
	|	Посещаемость.ВместоКакойДаты <> """"
	//|	И Посещаемость.Дата <= Посещаемость.ВместоКакойДаты
	|	И Посещаемость.ВместоКакойДаты МЕЖДУ &ДатаН И &ДатаК";
		//"ВЫБРАТЬ
		//|	СводныйОтчетДвиженияСрезПоследних.Организация КАК Организация,
		//|	СводныйОтчетДвиженияСрезПоследних.ДатаСоздания КАК ДатаСоздания,
		//|	СводныйОтчетДвиженияСрезПоследних.ПериодНачало КАК ПериодНачало,
		//|	СводныйОтчетДвиженияСрезПоследних.ПериодОкончания КАК ПериодОкончания,
		//|	СводныйОтчетДвиженияСрезПоследних.СледующаяДатаСоздания КАК СледующаяДатаСоздания
		//|ИЗ
		//|	РегистрСведений.СводныйОтчетДвижения.СрезПоследних КАК СводныйОтчетДвиженияСрезПоследних
		//|ГДЕ
		//|	СводныйОтчетДвиженияСрезПоследних.СледующаяДатаСоздания МЕЖДУ &СледующаяДатаСозданияН И &СледующаяДатаСозданияК";
	
	Запрос.УстановитьПараметр("ДатаН", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаК", КонецДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда 
			Док = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Док.Дата = ВыборкаДетальныеЗаписи.ВместоКакойДаты;
			//Док.ДатаНачала = ТекущаяДата();
			//Док.ДатаОкончания = ДобавитьКДате(ВыборкаДетальныеЗаписи.СледующаяДатаСоздания,"ДЕНЬ",КоличествоДней);
			//Док.Организация=Справочники.Организации.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.Организация,Истина,,);
			Док.Записать();                                         
			
		КонецЕсли;          
		//ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Создание документа",УровеньЖурналаРегистрации.Информация,,,"Дней после первого документа " + РазностьДат(ТекущаяДата(),ВыборкаДетальныеЗаписи.СледующаяДатаСоздания,"ДЕНЬ") +Символы.ПС+"Дней необходимо: " +КоличествоДней);
	КонецЦикла;
	

КонецПроцедуры


Процедура ЗагрузкаДипломовИзПапки() Экспорт
	
	ПутьКФайлу=Константы.ПутьКФайлу.Получить();
	//ПутьКАрхиву=Константы.ПутьДляЗагрузкиДипломовАрхив.Получить(); 
	//Файлы = НайтиФайлы(ПутьКФайлу,"*.xlsx",Ложь);
	
	//Для Каждого Файл из Файлы Цикл

	//	Если Файлы.Количество()>0 Тогда
			
			//ДатаСоздания = Файл.ПолучитьВремяИзменения();
			//ИмяФайла = Файл.ПолноеИмя;
			////ИмяФайлаА=Файл.Имя;
			//ДанныеДокумента = Новый Структура;
			//ДанныеДокумента.Вставить("Дата", ДатаСоздания);
			////Архив = ПутьКАрхиву + ИмяФайлаА; 
			Запрос = Новый Запрос;
			Запрос.Текст =
			   "ВЫБРАТЬ
			   |	ПланПоЧасам.Период КАК Период,
			   |	ПланПоЧасам.Группа КАК Группа,
			   |	ПланПоЧасам.НаЧтоЗапланированы КАК НаЧтоЗапланированы,
			   |	ПланПоЧасам.КоличествоЧасов КАК КоличествоЧасов,
			   |	ПланПоЧасам.Загружен КАК Загружен,
			   |	ПланПоЧасам.УчГод КАК УчГод,
			   |	ПланПоЧасам.Дисциплина КАК Дисциплина
			   |ИЗ
			   |	РегистрСведений.ПланПоЧасам КАК ПланПоЧасам";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
			//Если ВыборкаДетальныеЗаписи.Количество()=0 Тогда
				НомерСтроки = 2; // Пропускаем заголовок
				// Подключаем COM объект Excel
						Excel = Новый COMОбъект("Excel.Application");
					    Excel.Visible = Ложь;
					    Книга = Excel.Workbooks.Open(ПутьКФайлу);
					    Лист = Книга.Worksheets(1);
				 
						Пока Истина Цикл
							Период = Лист.Cells(НомерСтроки,1).Value;
							Группа = Лист.Cells(НомерСтроки, 2).Value; 
							КоличествоЧасов = Лист.Cells(НомерСтроки, 3).Value;
							НаЧтоЗапланированы = Лист.Cells(НомерСтроки, 4).Value;
							УчГод = Лист.Cells(НомерСтроки, 5).Value; 
							Дисциплина = Лист.Cells(НомерСтроки, 6).Value;
						
					Попытка        
						Запись = РегистрыСведений.ПланПоЧасам.СоздатьМенеджерЗаписи();
						Запись.Период=Период;
						Запись.Группа=Справочники.Группы.НайтиПоНаименованию(Группа);
						Если НаЧтоЗапланированы = "Зачет" Тогда
							Запись.НаЧтоЗапланированы=Перечисления.ВидЗанятия.Зачет;
						ИначеЕсли НаЧтоЗапланированы = "Защита ВКР" Тогда
							Запись.НаЧтоЗапланированы=Перечисления.ВидЗанятия.ЗащитаВКР;
						ИначеЕсли НаЧтоЗапланированы = "Руководство курсовым проектом" Тогда
							Запись.НаЧтоЗапланированы=Перечисления.ВидЗанятия.РуководствоКурсовымПроектом;
						ИначеЕсли НаЧтоЗапланированы = "Консультация" Тогда
							Запись.НаЧтоЗапланированы=Перечисления.ВидЗанятия.Консультация;
						ИначеЕсли НаЧтоЗапланированы = "Лабораторная" Тогда
							Запись.НаЧтоЗапланированы=Перечисления.ВидЗанятия.Лабораторная;
						ИначеЕсли НаЧтоЗапланированы = "Лекция" Тогда
							Запись.НаЧтоЗапланированы=Перечисления.ВидЗанятия.Лекция;
						ИначеЕсли НаЧтоЗапланированы = "Практика" Тогда
							Запись.НаЧтоЗапланированы=Перечисления.ВидЗанятия.Практика;
						ИначеЕсли НаЧтоЗапланированы = "Экзамен" Тогда
							Запись.НаЧтоЗапланированы=Перечисления.ВидЗанятия.Экзамен;
						ИначеЕсли НаЧтоЗапланированы = "Защита ВКР Бакалавр" Тогда
							Запись.НаЧтоЗапланированы=Перечисления.ВидЗанятия.Защита_ВКР_бакалавров;
						ИначеЕсли НаЧтоЗапланированы = "Защита курсовой" Тогда
							Запись.НаЧтоЗапланированы=Перечисления.ВидЗанятия.ЗащитаКурсовогоПроекта;
						ИначеЕсли НаЧтоЗапланированы = "Защита курсового проекта" Тогда
							Запись.НаЧтоЗапланированы=Перечисления.ВидЗанятия.ЗащитаКурсовой;
						КонецЕсли;
						Запись.Дисциплина = Справочники.Дисциплина.НайтиПоНаименованию(Дисциплина,Истина,,);
						Запись.КоличествоЧасов=КоличествоЧасов;
						Запись.УчГод=Справочники.Стоимость.НайтиПоНаименованию(УчГод,Истина,,);
						Запись.Загружен=Истина;
						Запись.Записать(Истина);
						НомерСтроки = НомерСтроки + 1;
                        ЗаписьЖурналаРегистрации("Информация",УровеньЖурналаРегистрации.Информация,РегистрыСведений.ПланПоЧасам,,"Данные загружены",РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
					Исключение
						Прервать;
						ЗаписьЖурналаРегистрации("Ошибка",УровеньЖурналаРегистрации.Ошибка,РегистрыСведений.ПланПоЧасам,,"Данные НЕ загружены",РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
				КонецПопытки;
			КонецЦикла;
				Книга.Close(Ложь);
				Excel.Quit();
			//КонецЕсли;
		//КонецЕсли; 
	//КонецЦикла;
	
	
КонецПроцедуры

Процедура СозданиеДокументаОплата() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры
