
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
ПутьКФайлу = "C:\repo\eis2-mf\features\Продажи\Продажи - Экспорт сценарий.feature";

//создаем объект для чтения
Текст = Новый ЧтениеТекста(
    ПутьКФайлу, КодировкаТекста.ANSI);

//читаем файл построчно
Пока Истина Цикл
    Строка = Текст.ПрочитатьСтроку("Сценарий:");
    Если Строка = Неопределено Тогда
        Прервать;
    КонецЕсли;
    Сообщить(Строка);
	Запись = Объект.ЭкспортныеСценарии.Добавить();
	Запись.Сценарий = Текст.ПрочитатьСтроку("Сценарий:");
	//Для Каждого 
	//Если Строка = "Сценарий" Тогда
	//	Элементы.ЭкспортныеСценарии.ДобавитьСтроку();
	//	Элементы.ЭкспортныеСценарииСценарий = Строка;
	//ИначеЕсли Строка = "#" Тогда 
	//	Элементы.ЭкспортныеСценарииОписание = Строка;
	//КонецЕсли;
	
	
КонецЦикла;

Текст.Закрыть();

КонецПроцедуры
