
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
ПутьКФайлу = "C:\repo\eis2-mf\features\Продажи\Продажи - Экспорт сценарий.feature";

//читаем файла
НашФайл = Новый ТекстовыйДокумент;
НашФайл.Прочитать(ПутьКФайлу);

//построчно заносим текст в массив
Строки = Новый Массив;
Для Н = 1 По НашФайл.КоличествоСтрок() Цикл
    //читаем текущую строку
    Строка = НашФайл.ПолучитьСтроку(Н);
    Строки.Добавить(Строка);
КонецЦикла;
Сообщить(Строки.Найти("//"));

КонецПроцедуры
