&НаСервере
Функция ПолучитьТекстИзReadme()
	
	// 1. Получаем путь из константы (работает только на сервере)
	ПутьКФайлу = Константы.ПутьКФайлуReadme.Получить();
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		Возврат "<b>Ошибка:</b> Константа 'ПутьКReadme' не заполнена.";
	КонецЕсли;
	
	// 2. Проверяем существование файла
	//Если НЕ ФайлСуществует(ПутьКФайлу) Тогда
	//	Возврат "<b>Ошибка:</b> Файл не найден по пути: " + ПутьКФайлу;
	//КонецЕсли;
	
	// 3. Читаем файл
	Читалка = Новый ТекстовыйДокумент;
	Попытка
		Читалка.Прочитать(ПутьКФайлу, КодировкаТекста.UTF8);
	Исключение
		Возврат "<b>Ошибка при чтении файла:</b> " + ОписаниеОшибки();
	КонецПопытки;
	
	ТекстИзФайла = Читалка.ПолучитьТекст();
	
	// 4. Преобразуем переносы строк в HTML-теги <br>
	//ТекстДляОтображения = СтрЗаменить(ТекстИзФайла, Символы.ПС, "<br>");
	//
	//Возврат ТекстДляОтображения;
	Возврат ТекстИзФайла;
	
КонецФункции


&НаСервере
Функция ПолучитьПутьКФайлу()
	
	
	ПутьКФайлу = Константы.ПутьКФайлу.Получить();

	Возврат ПутьКФайлу;
	
КонецФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	//ПутьКФайлу=Константы.ПутьКФайлу.Получить();
	//ЭтотОбъект.КонстантаПуть=Константы.ПутьКФайлу.Получить();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
		// Вызываем серверную функцию, получаем готовый HTML
	ТекстHTML = ПолучитьТекстИзReadme();
	
	// Записываем в реквизит формы, связанный с полем HTML-документа
	ЭтотОбъект.ТекстHTML = ТекстHTML;
	
	ПутьКФайлу=ПолучитьПутьКФайлу();
	ЭтотОбъект.КонстантаПуть=ПутьКФайлу;
КонецПроцедуры
