
Функция Посещаемость(НачалоПериода, КонецПериода, Преподаватель)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	 "ВЫБРАТЬ
	 |	Посещаемость.Ссылка КАК Ссылка,
	 |	Посещаемость.ВерсияДанных КАК ВерсияДанных,
	 |	Посещаемость.ПометкаУдаления КАК ПометкаУдаления,
	 |	Посещаемость.Номер КАК Номер,
	 |	Посещаемость.Дата КАК Дата,
	 |	Посещаемость.Проведен КАК Проведен,
	 |	Посещаемость.Дисциплина КАК Дисциплина,
	 |	Посещаемость.Группа КАК Группа,
	 |	Посещаемость.КоличествоЧасов КАК КоличествоЧасов,
	 |	Посещаемость.Пары КАК Пары,
	 |	Посещаемость.ВидЗанятия КАК ВидЗанятия,
	 |	Посещаемость.ДатаЭкзамена КАК ДатаЭкзамена,
	 |	Посещаемость.ДатаКурсовой КАК ДатаКурсовой,
	 |	Посещаемость.ОплатаЗаПериод КАК ОплатаЗаПериод,
	 |	Посещаемость.СуммаКВыдаче КАК СуммаКВыдаче,
	 |	Посещаемость.Итого КАК Итого,
	 |	Посещаемость.Курс КАК Курс,
	 |	Посещаемость.СколькоПришлоСтудентов КАК СколькоПришлоСтудентов,
	 |	Посещаемость.ПланПоЧасам КАК ПланПоЧасам,
	 |	Посещаемость.ИтогоВГруппе КАК ИтогоВГруппе,
	 |	Посещаемость.ВместоКакойДаты КАК ВместоКакойДаты,
	 |	Посещаемость.Комментарий КАК Комментарий,
	 |	Посещаемость.НеПодаватьВОтчет КАК НеПодаватьВОтчет,
	 |	Посещаемость.Студенты.(
	 |		Ссылка КАК Ссылка,
	 |		НомерСтроки КАК НомерСтроки,
	 |		Студент КАК Студент,
	 |		Присутствует КАК Присутствует,
	 |		Оценка КАК Оценка,
	 |		Комментарий КАК Комментарий,
	 |		Баллов КАК Баллов,
	 |		ТемаКурсовой КАК ТемаКурсовой,
	 |		СтепеньРаскрытияТемы КАК СтепеньРаскрытияТемы,
	 |		ПолнотаОхватаНаучнойЛитературы КАК ПолнотаОхватаНаучнойЛитературы,
	 |		ИспользованиеНормативныхАктов КАК ИспользованиеНормативныхАктов,
	 |		ИндивидуальностьПодходаКНаписаниюКР КАК ИндивидуальностьПодходаКНаписаниюКР,
	 |		ПоследовательностьИЛогикаИзложенияМатериала КАК ПоследовательностьИЛогикаИзложенияМатериала,
	 |		КачествоОформления КАК КачествоОформления,
	 |		ИспользованиеИллюстративногоМатериала КАК ИспользованиеИллюстративногоМатериала,
	 |		Защита КАК Защита,
	 |		КоличествоСтрок КАК КоличествоСтрок,
	 |		ОценкаН КАК ОценкаН
	 |	) КАК Студенты,
	 |	Посещаемость.Представление КАК Представление,
	 |	Посещаемость.МоментВремени КАК МоментВремени
	 |ИЗ
	 |	Документ.Посещаемость КАК Посещаемость
	 |ГДЕ
	 |	Посещаемость.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
		//"ВЫБРАТЬ
		//|	Посещаемость.Номенклатура.Наименование КАК НоменклатураНаименование,
		//|	Посещаемость.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
		//|	Посещаемость.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
		//|	Посещаемость.КоличествоПриход КАК КоличествоПриход,
		//|	Посещаемость.КоличествоРасход КАК КоличествоРасход
		//|ИЗ
		//|	Документы.Посещаемость(&НачалоПериода, &КонецПериода, Запись, , Склад = &Склад) КАК ТоварыНаСкладахОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	//Запрос.УстановитьПараметр("Преподаватель", Справочники..НайтиПоНаименованию(Склад,истина));
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	Хранилище = новый ХранилищеЗначения(ТаблицаРезультата);
	Возврат Хранилище;
КонецФункции
