
Процедура ПеределатьКод() Экспорт
	
	
	Счет = 0;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Студенты.Ссылка КАК Ссылка,
		|	Студенты.Должность КАК Должность
		|ИЗ
		|	Справочник.Студенты КАК Студенты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Об = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Об.Код = Счет+1;
		Об.Должность = Перечисления.Должности.Студент;
		Об.Записать();
		Счет = Счет +1;
		//Об.Записать();
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
		
КонецПроцедуры


Функция ПолучитьСиноним () Экспорт 
	ТекстСиноним=Метаданные.Синоним;
	ТЕкстВерсия=Метаданные.Версия;
	ЗаголовокНовый = ТекстСиноним + " v." + ТЕкстВерсия;
	Возврат ЗаголовокНовый;
КонецФункции
