
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
      ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "Вы действительно хотите загрузить данные?",
        РежимДиалогаВопрос.ДаНетОтмена,
        0, // таймаут в секундах
        КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
        "Загрузка плана по часам" // (необ.) заголовок
    );    
	
	//Ответ = Вопрос("Вы действительно хотите загрузить данные?",РежимДиалогаВопрос.ДаНетОтмена,30,,"Загрузка плана по часам",);
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
		Заполнение();
		//ОткрытьФорму("РегистрСведений.ПланПоЧасам.ФормаСписка", ,ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		ОткрытьФорму("РегистрСведений.ПланПоЧасам.ФормаСписка",,,,,,,);	
	Иначе
	КонецЕсли;	
 
КонецПроцедуры


&НаСервере
Процедура Заполнение()
	
	МодульРЗСервВнешСоед.ЗагрузкаДипломовИзПапки();
	
	//ОткрытьФорму("РегистрСведений.ПланПоЧасам.ФормаСписка", ,ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
