
&НаСервере
Процедура ГруппаПриИзмененииНаСервере()
	
	Если Объект.НесколькоГрупп=Ложь Тогда
		Объект.Студенты.Очистить();
	КонецЕсли;
	
	//Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Студенты.Ссылка КАК Студент,
		               |	Студенты.ТемаКурсовой КАК ТемаКурсовой,
		               |	Студенты.Группа КАК Группа
		               |ИЗ
		               |	Справочник.Студенты КАК Студенты
		               |ГДЕ
		               |	Студенты.Группа = &Группа
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Студенты.Ссылка";
		Запрос.УстановитьПараметр("Группа", Объект.Группа);
		Результат=Запрос.Выполнить().Выгрузить();
		Объект.Студенты.Загрузить(Результат);
	//КонецЕсли;
	
		
КонецПроцедуры


&НаСервере
Процедура ГруппаНаСервере()
	
	Если Объект.НесколькоГрупп=Ложь Тогда
		Объект.Студенты.Очистить();
	КонецЕсли;		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Студенты.Ссылка КАК Студент,
		               |	Студенты.ТемаКурсовой КАК ТемаКурсовой,
		               |	Студенты.Группа КАК Группа
		               |ИЗ
		               |	Справочник.Студенты КАК Студенты
		               |ГДЕ
		               |	Студенты.Группа = &Группа
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Студенты.Ссылка";
		Запрос.УстановитьПараметр("Группа", НомерГруппы);
		
		Выборка= Запрос.Выполнить().Выбрать();
	    Пока Выборка.Следующий() Цикл
	            ЗаполнитьЗначенияСвойств(Объект.Студенты.Добавить(), Выборка);
	    КонецЦикла;
		//Результат=Запрос.Выполнить().Выгрузить();
		//Объект.Студенты.Загрузить(Результат);
	//КонецЕсли;
	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатаЭкзамена(Группа)
    
	ДатаЭкзамена =Группа.ДатаЗачетаЭкзамена;
	Возврат ДатаЭкзамена;
    
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьТемуКурсовой(Студент)
    
	ТемаКурсовой =Студент.ТемаКурсовой;
	Возврат ТемаКурсовой;
    
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьКурс(Группа)
    
	Курс =Группа.Курс;
	Возврат Курс;
    
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьДатаКурсовой(Группа)
    
	ДатаКурсовой =Группа.ДатаКурсовой;
	Возврат ДатаКурсовой;
    
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЦену(Дата, ОплатаЗаПериод)
    
	Отбор = Новый Структура("ОплатаЗаПериод", ОплатаЗаПериод);
	ЦенаТовара = РегистрыСведений.СтоимостьЧаса.ПолучитьПоследнее(Дата,Отбор);
	Возврат ЦенаТовара.СуммаКВыдаче;
	    
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЦенуСтудента(Дата, ОплатаЗаПериод)
    
	Отбор = Новый Структура("ОплатаЗаПериод", ОплатаЗаПериод);
	ЦенаСтудента = РегистрыСведений.СтоимостьЧаса.ПолучитьПоследнее(Дата,Отбор);
	Возврат ЦенаСтудента.ЦенаСтудента;
	    
КонецФункции


&НаСервере
Процедура УстановитьКомандыПечать()
	
	    ИмяКоманды = "КонсультационныйЛист";
	Если Команды.Найти(ИмяКоманды) = Неопределено Тогда
		НоваяКоманда = Команды.Добавить(ИмяКоманды);
	    НоваяКоманда.Действие  = "КонсЛист";
    	НоваяКнопка = Элементы.Добавить("ФормаПечатьКонсультационныйЛист", Тип("КнопкаФормы"), КоманднаяПанель);
		НоваяКнопка.Заголовок = "Отзыв к курсовой";
		НоваяКнопка.ИмяКоманды = ИмяКоманды;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	
	ГруппаПриИзмененииНаСервере();
	
	Объект.ДатаЭкзамена = ПолучитьДатаЭкзамена(Объект.Группа);
	Объект.ДатаКурсовой= ПолучитьДатаКурсовой(Объект.Группа);
	Объект.Курс= ПолучитьКурс(Объект.Группа);

	Если ПустаяСтрока(Объект.Группа) Тогда 
		Элементы.Группа3.Видимость=Ложь;	
	Иначе	
		Элементы.Группа3.Видимость=Истина;
	КонецЕсли;
	
	Если Объект.НесколькоГрупп=Истина Тогда
		Объект.КоличествоГрупп=Объект.КоличествоГрупп+"; "+Объект.Группа;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Сумма()
	
	Если Объект.ВидЗанятия=ПредопределенноеЗначение("Перечисление.ВидЗанятия.ЗащитаКурсовой") Или Объект.ВидЗанятия=ПредопределенноеЗначение("Перечисление.ВидЗанятия.Консультация") 
		ИЛИ Объект.ВидЗанятия=ПредопределенноеЗначение("Перечисление.ВидЗанятия.Экзамен") 
		ИЛИ Объект.ВидЗанятия=ПредопределенноеЗначение("Перечисление.ВидЗанятия.Зачет")
		ИЛИ Объект.ВидЗанятия=ПредопределенноеЗначение("Перечисление.ВидЗанятия.Защита_ВКР_бакалавров")Тогда 
		Элементы.КоличествоЧасов.Доступность=Истина;
		Объект.КоличествоЧасов=ПолучитьЦенуСтудента(Объект.Дата,Объект.ОплатаЗаПериод)*Объект.СколькоПришлоСтудентов;
	Иначе
		Объект.КоличествоЧасов=Объект.Пары*2;
	КонецЕсли;

		Объект.Итого=Объект.СуммаКВыдаче*Объект.КоличествоЧасов;

КонецПроцедуры


&НаКлиенте
Процедура ПарыПриИзменении(Элемент)
	
Сумма();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПустаяСтрока(Объект.Группа) Тогда 
		Элементы.Группа3.Видимость=Ложь;	
	Иначе	
		Элементы.Группа3.Видимость=Истина;
	КонецЕсли;
	
	ДЛя Каждого СТЧ из Объект.Студенты Цикл 
		СТЧ.КоличествоСтрок = 1;
	КонецЦикла;
	
	
	//КоличествоСтрокВТЧ = 

КонецПроцедуры

&НаКлиенте
Процедура ПолучениеОценки()
	
	ТЧ=Элементы.Студенты.ТекущиеДанные;
	
	Если ТЧ.Баллов<50 Тогда 
		ТЧ.Оценка = 2;
	ИначеЕсли ТЧ.Баллов>=50 и ТЧ.Баллов<=60 Тогда
		ТЧ.Оценка = 3;
	ИначеЕсли ТЧ.Баллов>=60 и ТЧ.Баллов<80 Тогда
		ТЧ.Оценка = 4;
	ИначеЕсли ТЧ.Баллов>=80 Тогда
		ТЧ.Оценка = 5;
	ИначеЕсли ТЧ.Баллов = 0 ИЛИ ТЧ.Баллов = " " Тогда
		ТЧ.Оценка =0;

	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СтудентыБалловПриИзменении(Элемент)
	
	ПолучениеОценки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаЗаПериодПриИзменении(Элемент)
	
	Объект.СуммаКВыдаче=ПолучитьЦену(Объект.Дата,Объект.ОплатаЗаПериод);
	
	Объект.Итого=Объект.СуммаКВыдаче*Объект.КоличествоЧасов;
	
	ПересчитатьНаСервере();

КонецПроцедуры

&НаСервере
Функция ПолучитьМакетАкт2020()
	
	 
Печать = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ОтзывНаКР");


Возврат Печать;
				
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьКомандыПечать(); 
	Если Объект.НесколькоГрупп=Ложь Тогда
		Элементы.ГруппыТЧ.Видимость=Ложь;
		Элементы.Группа.Доступность=Истина;
	Иначе
		Элементы.ГруппыТЧ.Видимость=Истина;
		Элементы.Группа.Доступность=Ложь;
	КонецЕсли;
	
		
КонецПроцедуры


&НаКлиенте
Процедура КонсЛист(СписокСтрок) 
	
	//Если Элементы.Студенты.ТекущаяСтрока <> Неопределено Тогда
	//Если Не ЗначениеЗаполнено(Объект.Студент) Тогда
	//	Предупреждение("Не выбран студент, консультационный лист не будет сформирован!", 15);
	//	Возврат;
	//КонецЕсли;
		
	Состояние("Формирование консультационного листа...");
	
	Макет = ПолучитьМакетАкт2020();	
	ВременныйПуть = КаталогВременныхФайлов();
	ИмяВременногоФайла = ВременныйПуть + "Консультационный лист.doc";
	ФайлШаблона = Новый Файл(ИмяВременногоФайла);
	Попытка
		Макет.Записать(ИмяВременногоФайла);
	Исключение
		ИмяВременногоФайла = ВременныйПуть + "Консультационный лист1.doc";
		ФайлШаблона = Новый Файл(ИмяВременногоФайла);
		Попытка
			Макет.Записать(ИмяВременногоФайла);
		Исключение
			ИмяВременногоФайла = ВременныйПуть + "Консультационный лист2.doc";
			ФайлШаблона = Новый Файл(ИмяВременногоФайла);
			Попытка
				Макет.Записать(ИмяВременногоФайла);
			Исключение
				ИмяВременногоФайла = ВременныйПуть + "Консультационный лист3.doc";
				ФайлШаблона = Новый Файл(ИмяВременногоФайла);
				Попытка
					Макет.Записать(ИмяВременногоФайла);
				Исключение
					ИмяВременногоФайла = ВременныйПуть + "Консультационный лист4.doc";
					ФайлШаблона = Новый Файл(ИмяВременногоФайла);
					Попытка
						Макет.Записать(ИмяВременногоФайла);
					Исключение
						ИмяВременногоФайла = ВременныйПуть + "Консультационный лист5.doc";
						ФайлШаблона = Новый Файл(ИмяВременногоФайла);
						Макет.Записать(ИмяВременногоФайла);
					КонецПопытки;
				КонецПопытки;
			КонецПопытки;
		КонецПопытки;
	КонецПопытки;		
	
	Попытка
		MSWord = Новый COMОбъект("Word.Application");
			Документ = MSWord.Documents.ADD(ИмяВременногоФайла);
		ПриказОКонсультантахМ(Документ, MSWord, ИмяВременногоФайла, , СписокСтрок);
		MSWord.Visible = 1; 
		MSWord.Activate(); 
	Исключение
		Сообщить(ОписаниеОшибки());
		MSWord.Application.Quit();
	КонецПопытки;
	
//Иначе 
//	Сообщить("Не выбран студент, консультационный лист не будет сформирован!");
//	
//КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПриказОКонсультантахМ(Документ, MSWord, ИмяВременногоФайла, Сколько = "", СписокСтрок = Неопределено)

	//КоличествоСтрокВТЧ = Объект.Студенты.Итог("КоличествоСтрок");
	СписокСтрок = Новый Массив;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Выбран", Истина);
	ВыбранныеСтроки = Объект.Студенты.НайтиСтроки(ПараметрыОтбора);
	
	Для каждого ВыбраннаяСтрока из ВыбранныеСтроки Цикл
		
		СписокСтрок.Добавить(ВыбраннаяСтрока);
		
	КонецЦикла;
	
	Если Сколько = "" Тогда // только выбранные строки
		
		КоличествоСтрок = СписокСтрок.Количество();
		НомерСтроки = 0; 
		
		Для каждого Данные Из СписокСтрок Цикл

			Для каждого СтрокаСумм Из Объект.Студенты Цикл
				Если СтрокаСумм.Выбран = Истина Тогда 
					для А=1 По 17 Цикл  
						Замена = Документ.Content.Find; 
						Замена.Execute("<Дисциплина>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Объект.Дисциплина));
						Замена.Execute("<Тема>", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(Данные.ТемаКурсовой));
						Замена.Execute("<Студент>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Данные.Студент));
						Замена.Execute("<Курс>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Объект.Курс));
						Замена.Execute("<Группа>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Объект.Группа));
						Замена.Execute("<Руководитель Курсовой>", Ложь, Истина, Ложь, , , Истина, , Ложь, "");	
			    		СтепеньРаскрытияТемы = СтрокаСумм.СтепеньРаскрытияТемы;
			    		ПолнотаОхватаНаучнойЛитературы = СтрокаСумм.ПолнотаОхватаНаучнойЛитературы;
						ИспользованиеНормативныхАктов = СтрокаСумм.ИспользованиеНормативныхАктов;
						ИндивидуальностьПодходаКНаписаниюКР = СтрокаСумм.ИндивидуальностьПодходаКНаписаниюКР;
						ПоследовательностьИЛогикаИзложенияМатериала = СтрокаСумм.ПоследовательностьИЛогикаИзложенияМатериала;
						КачествоОформления = СтрокаСумм.КачествоОформления;
						ИспользованиеИллюстративногоМатериала = СтрокаСумм.ИспользованиеИллюстративногоМатериала;
						Защита = СтрокаСумм.Защита;
						Баллов = СтрокаСумм.Баллов;
						Замена = Документ.Content.Find;			
						Замена.Execute("<СтепеньРаскрытияТемы>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Данные.СтепеньРаскрытияТемы,"ЧН=0"));
						Замена.Execute("<ПолнотаОхватаНаучнойЛитературы>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Данные.ПолнотаОхватаНаучнойЛитературы,"ЧН=0"));
						Замена.Execute("<ИспользованиеНормативныхАктов>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Данные.ИспользованиеНормативныхАктов,"ЧН=0"));
						Замена.Execute("<ИндивидуальностьПодходаКНаписаниюКР>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Данные.ИндивидуальностьПодходаКНаписаниюКР,"ЧН=0"));
						Замена.Execute("<ПоследовательностьИЛогикаИзложенияМатериала>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Данные.ПоследовательностьИЛогикаИзложенияМатериала,"ЧН=0"));
						Замена.Execute("<КачествоОформления>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Данные.КачествоОформления,"ЧН=0"));
						Замена.Execute("<ИспользованиеИллюстративногоМатериала>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Данные.ИспользованиеИллюстративногоМатериала,"ЧН=0"));
						Замена.Execute("<Защита>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Данные.Защита,"ЧН=0"));
						Замена.Execute("<ИтогСодержания>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Данные.СтепеньРаскрытияТемы+Данные.ПолнотаОхватаНаучнойЛитературы+Данные.ИспользованиеНормативныхАктов+Данные.ИндивидуальностьПодходаКНаписаниюКР+Данные.ПоследовательностьИЛогикаИзложенияМатериала,"ЧН=0"));
						Замена.Execute("<ИтогОФормление>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Данные.КачествоОформления + Данные.ИспользованиеИллюстративногоМатериала,"ЧН=0"));
						Замена.Execute("<ОбщийИтог>", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Данные.Баллов,"ЧН=0"));
					КонецЦикла;	
				Иначе
					//Сообщить(СтрокаСумм.Студент + " не выбран для печати отзыва");
				КонецЕсли;
			КонецЦикла;
					
			НомерСтроки = НомерСтроки + 1;
			
			Если НомерСтроки <> КоличествоСтрок Тогда
				Документ.sections.add(Документ.characters.last,2).Range.Select(); 
				MSWord.Selection.InsertFile(ИмяВременногоФайла);
			КонецЕсли; 
			
	КонецЦикла;

	MSWord.Visible = 1; 
	MSWord.Activate(); 
Иначе
	
КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсе(Команда)
	//Сообщить("Пока в разработке",СтатусСообщения.ОченьВажное);
	для Каждого СТЧ Из Объект.Студенты Цикл 
		Если СТЧ.Выбран = Ложь Тогда 
			СТЧ.Выбран = Истина;
		Иначе
			СТЧ.Выбран = Ложь;
		КонецЕсли;
	КонецЦикла;
	
			
КонецПроцедуры


&НаКлиенте
Процедура ВидЗанятияПриИзменении(Элемент)
	Если Объект.ВидЗанятия=ПредопределенноеЗначение("Перечисление.ВидЗанятия.ЗащитаКурсовой") Или Объект.ВидЗанятия=ПредопределенноеЗначение("Перечисление.ВидЗанятия.Консультация") ИЛИ Объект.ВидЗанятия=ПредопределенноеЗначение("Перечисление.ВидЗанятия.Экзамен") Тогда 
		Элементы.КоличествоЧасов.Доступность=Истина;
	//Объект.КоличествоЧасов=Объект.ПланПоЧасам/Объект.ИтогоВГруппе*Объект.СколькоПришлоСтудентов;
КонецЕсли;

ПересчитатьНаСервере();

КонецПроцедуры


&НаКлиенте
Процедура СколькоПришлоСтудентовПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.ПланПоЧасам) и ПустаяСтрока(Объект.ИтогоВГруппе) Тогда
	Иначе
		Сумма();
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПланПоЧасамПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.СколькоПришлоСтудентов) и ПустаяСтрока(Объект.ИтогоВГруппе) Тогда
	Иначе
		Сумма();
	КонецЕсли;
	

КонецПроцедуры


&НаКлиенте
Процедура ИтогоВГруппеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.СколькоПришлоСтудентов) и ПустаяСтрока(Объект.ПланПоЧасам) Тогда
	Иначе
		Сумма();
	КонецЕсли;

КонецПроцедуры

 &НаКлиенте
Процедура ПересчетБаллов()
	
	СтТЧ=Элементы.Студенты.ТекущиеДанные;
	СтТЧ.Баллов = СтТЧ.СтепеньРаскрытияТемы + СтТЧ.ПолнотаОхватаНаучнойЛитературы + СтТЧ.ИспользованиеНормативныхАктов + СтТЧ.ИндивидуальностьПодходаКНаписаниюКР + СтТЧ.ПоследовательностьИЛогикаИзложенияМатериала + СтТЧ.КачествоОформления + СтТЧ.ИспользованиеИллюстративногоМатериала + СтТЧ.Защита;
	
КонецПроцедуры


&НаКлиенте
Процедура СтудентыПолнотаОхватаНаучнойЛитературыПриИзменении(Элемент)
	ПересчетБаллов();
	ПолучениеОценки();
КонецПроцедуры


&НаКлиенте
Процедура СтудентыИспользованиеНормативныхАктовПриИзменении(Элемент)
	ПересчетБаллов();
	ПолучениеОценки();
КонецПроцедуры


&НаКлиенте
Процедура СтудентыИндивидуальностьПодходаКНаписаниюКРПриИзменении(Элемент)
	ПересчетБаллов();
	ПолучениеОценки();
КонецПроцедуры


&НаКлиенте
Процедура СтудентыПоследовательностьИЛогикаИзложенияМатериалаПриИзменении(Элемент)
	ПересчетБаллов();
	ПолучениеОценки();
КонецПроцедуры


&НаКлиенте
Процедура СтудентыКачествоОформленияПриИзменении(Элемент)
	ПересчетБаллов();
	ПолучениеОценки();
КонецПроцедуры


&НаКлиенте
Процедура СтудентыИспользованиеИллюстративногоМатериалаПриИзменении(Элемент)
	ПересчетБаллов();
	ПолучениеОценки();
КонецПроцедуры


&НаКлиенте
Процедура СтудентыЗащитаПриИзменении(Элемент)
	ПересчетБаллов();
	ПолучениеОценки();
КонецПроцедуры


&НаКлиенте
Процедура СтудентыСтепеньРаскрытияТемыПриИзменении(Элемент)
	ПересчетБаллов();
	ПолучениеОценки();
КонецПроцедуры


&НаКлиенте
Процедура СтудентыСтудентПриИзменении(Элемент)
	СТЧ = Элементы.Студенты.ТекущиеДанные;
	СТЧ.ТемаКурсовой = ПолучитьТемуКурсовой(СТЧ.Студент);
КонецПроцедуры


&НаСервере
Процедура ДисциплинаПриИзмененииНаСервере()
		
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДомашнееЗаданиеСрезПоследних.Группа КАК Группа,
		|	ДомашнееЗаданиеСрезПоследних.Дисциплина КАК Дисциплина,
		|	ДомашнееЗаданиеСрезПоследних.УчебныйГод КАК УчебныйГод,
		|	ДомашнееЗаданиеСрезПоследних.ДЗ КАК ДомашнееЗадание,
		|	ДомашнееЗаданиеСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ДомашнееЗадание.СрезПоследних КАК ДомашнееЗаданиеСрезПоследних
		|ГДЕ
		|	ДомашнееЗаданиеСрезПоследних.Группа = &Группа
		|	И ДомашнееЗаданиеСрезПоследних.Дисциплина = &Дисциплина
		|	И ДомашнееЗаданиеСрезПоследних.УчебныйГод = &УчебныйГод";
	
	Запрос.УстановитьПараметр("Группа", Объект.Группа);
	Запрос.УстановитьПараметр("Дисциплина", Объект.Дисциплина);
	Запрос.УстановитьПараметр("УчебныйГод", Объект.ОплатаЗаПериод);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.ДомашнееЗадание="Задание от "+Формат(ВыборкаДетальныеЗаписи.Период,"ДФ=dd.MM.yyyy")+":"+Символы.ПС+ВыборкаДетальныеЗаписи.ДомашнееЗадание;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	

КонецПроцедуры


&НаКлиенте
Процедура ДисциплинаПриИзменении(Элемент)
	ДисциплинаПриИзмененииНаСервере();
	ПересчитатьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Пересчитать(Команда)
	Число0=0;
	Если Объект.НесколькоГрупп=Ложь Тогда
		Объект.ЧасовЗапланировано=0;
	Иначе
		//Часы = Элементы.ГруппыТЧ.ТекущиеДанные;
		Объект.ЧасовЗапланировано =Объект.ГруппыТЧ.Итог("КоличествоЧасов");
		//Объект.ЧасовЗапланировано = Часы.Итог("ПланПоЧасам");
	КонецЕсли;
	
	Элементы.ЧасовОсталось.Заголовок="";
	ПересчитатьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПересчитатьНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланПоЧасамСрезПоследних.КоличествоЧасов КАК КоличествоЧасов
		|ИЗ
		|	РегистрСведений.ПланПоЧасам.СрезПоследних КАК ПланПоЧасамСрезПоследних
		|ГДЕ
		|	ПланПоЧасамСрезПоследних.Группа = &Группа
		|	И ПланПоЧасамСрезПоследних.НаЧтоЗапланированы = &НаЧтоЗапланированы
		|	И ПланПоЧасамСрезПоследних.УчГод = &УчГод
		|	И ПланПоЧасамСрезПоследних.Дисциплина = &Дисциплина";
	Если Объект.НесколькоГрупп=Ложь Тогда	
		Запрос.УстановитьПараметр("Группа", Объект.Группа);
	Иначе
		Запрос.УстановитьПараметр("Группа", НомерГруппы);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дисциплина", Объект.Дисциплина);
	Запрос.УстановитьПараметр("НаЧтоЗапланированы", Объект.ВидЗанятия);
	Запрос.УстановитьПараметр("УчГод", Объект.ОплатаЗаПериод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Количество()=0 Тогда
			Сообщить("Данные не найдены",СтатусСообщения.Информация);
			Элементы.ЧасовОсталось.Заголовок="Данные не найдены";
			Объект.ЧасовЗапланировано=0;
		Иначе
			Если Объект.ВидЗанятия<>Перечисления.ВидЗанятия.Экзамен или Объект.ВидЗанятия<>Перечисления.ВидЗанятия.ЗащитаКурсовой ИЛИ
			Объект.ВидЗанятия<>Перечисления.ВидЗанятия.Зачет Тогда
				Если Объект.НесколькоГрупп=Ложь Тогда
					Объект.ЧасовЗапланировано=ВыборкаДетальныеЗаписи.КоличествоЧасов;
				Иначе
					//ЗаполнитьЗначенияСвойств(Объект.ГруппыТЧ.Вставить(), ВыборкаДетальныеЗаписи);
				КонецЕсли;
				
			ИначеЕсли Объект.ВидЗанятия=Перечисления.ВидЗанятия.ЗащитаКурсовой Или Объект.ВидЗанятия=Перечисления.ВидЗанятия.Консультация ИЛИ Объект.ВидЗанятия=Перечисления.ВидЗанятия.Экзамен
				ИЛИ Объект.ВидЗанятия=Перечисления.ВидЗанятия.Зачет Тогда 
				Объект.ПланПоЧасам=ВыборкаДетальныеЗаписи.КоличествоЧасов
				
			КонецЕсли;
		
		КонецЕсли;

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СколькоЧасовОтработано.КоличествоЧасов КАК КоличествоЧасов
		|ИЗ
		|	РегистрСведений.СколькоЧасовОтработано КАК СколькоЧасовОтработано
		|ГДЕ
		|	СколькоЧасовОтработано.Группа = &Группа
		|	И СколькоЧасовОтработано.НаЧтоЗапланированы = &НаЧтоЗапланированы
		|	И СколькоЧасовОтработано.УчГод = &УчГод
		|	И СколькоЧасовОтработано.Дисциплина = &Дисциплина";
	
	Запрос.УстановитьПараметр("Группа", Объект.Группа);
	Запрос.УстановитьПараметр("Дисциплина", Объект.Дисциплина);
	Запрос.УстановитьПараметр("НаЧтоЗапланированы", Объект.ВидЗанятия);
	Запрос.УстановитьПараметр("УчГод", Объект.ОплатаЗаПериод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи1 = РезультатЗапроса.Выбрать();
	Число0=0;
	
	Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи1.Количество()=0 Тогда
			Элементы.ЧасовОсталось.Заголовок="";
		Иначе
			Число0=ВыборкаДетальныеЗаписи1.КоличествоЧасов+Число0;
			//Элементы.ЧасовОсталось.Заголовок=ВыборкаДетальныеЗаписи1.КоличествоЧасов; 
			Элементы.ЧасовОсталось.Заголовок=Число0;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

		ТекДата = НачалоДня(Объект.Дата);
	    НаборЗаписей = РегистрыСведений.СколькоЧасовОтработано.СоздатьНаборЗаписей();
		Если Объект.НесколькоГрупп=Ложь Тогда
			НаборЗаписей.Отбор.Группа.Установить(Объект.Группа);
		Иначе
			НаборЗаписей.Отбор.Группа.Установить(НомерГруппы);
		КонецЕсли;
		
		НаборЗаписей.Отбор.НаЧтоЗапланированы.Установить(Объект.ВидЗанятия);
		НаборЗаписей.Отбор.УчГод.Установить(Объект.ОплатаЗаПериод);
		НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
		НаборЗаписей.Отбор.Дисциплина.Установить(Объект.Дисциплина);
		НаборЗаписей.Отбор.Период.Установить(ТекДата);
		
	    НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда

	        НоваяЗапись = НаборЗаписей.Добавить();

	        НоваяЗапись.Период = ТекДата;
			Если Объект.НесколькоГрупп=Ложь Тогда
	        	НоваяЗапись.Группа = Объект.Группа;
			Иначе
				НоваяЗапись.Группа =НомерГруппы;
			КонецЕсли;
				
	        НоваяЗапись.НаЧтоЗапланированы = Объект.ВидЗанятия;
			НоваяЗапись.НесколькоГрупп = Объект.НесколькоГрупп;
			НоваяЗапись.УчГод = Объект.ОплатаЗаПериод; 
			НоваяЗапись.Организация = Объект.Организация;
			НоваяЗапись.Дисциплина = Объект.Дисциплина;
			НоваяЗапись.КоличествоЧасов = Объект.КоличествоЧасов;
			НоваяЗапись.КОплате = Объект.Итого;
		Иначе 
			НоваяЗапись = НаборЗаписей[0];
			Если  НоваяЗапись.КОплате <> Объект.Итого Тогда
				НоваяЗапись.КОплате = Объект.Итого;
			ИначеЕсли НоваяЗапись.НаЧтоЗапланированы <> Объект.ВидЗанятия Тогда
				//НоваяЗапись.Период = ТекДата;
				//Если Объект.НесколькоГрупп=Ложь Тогда
				//	НоваяЗапись.Группа = Объект.Группа;
				//Иначе
				//	НоваяЗапись.Группа =НомерГруппы;
				//КонецЕсли;
		        НоваяЗапись.НаЧтоЗапланированы = Объект.ВидЗанятия; 
				//НоваяЗапись.УчГод = Объект.ОплатаЗаПериод;
				//НоваяЗапись.Дисциплина = Объект.Дисциплина;
				//НоваяЗапись.КоличествоЧасов = Объект.КоличествоЧасов;
			//КонецЕсли;
			ИначеЕсли НоваяЗапись.Организация <> Объект.Организация Тогда
				НоваяЗапись.Организация = Объект.Организация;
			КонецЕсли;
			
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
		//ДЗ запись

		НаборЗаписейДЗ = РегистрыСведений.ДомашнееЗадание.СоздатьНаборЗаписей();
		Если Объект.НесколькоГрупп=Ложь Тогда
			НаборЗаписейДЗ.Отбор.Группа.Установить(Объект.Группа);
		Иначе
			НаборЗаписейДЗ.Отбор.Группа.Установить(НомерГруппы);
		КонецЕсли;
		
		//НаборЗаписейДЗ.Отбор.НаЧтоЗапланированы.Установить(Объект.ВидЗанятия);
		НаборЗаписейДЗ.Отбор.Организация.Установить(Объект.Организация);
		НаборЗаписейДЗ.Отбор.УчебныйГод.Установить(Объект.ОплатаЗаПериод);
		НаборЗаписейДЗ.Отбор.Дисциплина.Установить(Объект.Дисциплина);
		НаборЗаписейДЗ.Отбор.Период.Установить(ТекДата);
		
	    НаборЗаписейДЗ.Прочитать();
		
		Если НаборЗаписейДЗ.Количество() = 0 И НЕ ПустаяСтрока(Объект.ДомашнееЗадание) Тогда

	        НоваяЗапись = НаборЗаписейДЗ.Добавить();

	        НоваяЗапись.Период = ТекДата;
			Если Объект.НесколькоГрупп=Ложь Тогда
	        	НоваяЗапись.Группа = Объект.Группа;
			Иначе
				НоваяЗапись.Группа =НомерГруппы;
			КонецЕсли;
				
			//НоваяЗапись.НаЧтоЗапланированы = Объект.ВидЗанятия;
			//НоваяЗапись.НесколькоГрупп = Объект.НесколькоГрупп;
			НоваяЗапись.УчебныйГод = Объект.ОплатаЗаПериод;
			НоваяЗапись.Дисциплина = Объект.Дисциплина;
			НоваяЗапись.ДЗ = Объект.ДомашнееЗадание;
			НоваяЗапись.Организация = Объект.Организация;
			//НоваяЗапись.КоличествоЧасов = Объект.КоличествоЧасов;
			//НоваяЗапись.КОплате = Объект.Итого;
		ИначеЕсли НаборЗаписейДЗ.Количество() <> 0 И НЕ ПустаяСтрока(Объект.ДомашнееЗадание) Тогда 
			НоваяЗапись = НаборЗаписейДЗ[0];
			//Если  НоваяЗапись.КОплате <> Объект.Итого ИЛИ НоваяЗапись.НаЧтоЗапланированы <> Объект.ВидЗанятия Тогда
				НоваяЗапись.Период = ТекДата;
		        Если Объект.НесколькоГрупп=Ложь Тогда
		        	НоваяЗапись.Группа = Объект.Группа;
				Иначе
					НоваяЗапись.Группа =НомерГруппы;
				КонецЕсли;
				//НоваяЗапись.НаЧтоЗапланированы = Объект.ВидЗанятия; 
				НоваяЗапись.УчебныйГод = Объект.ОплатаЗаПериод;
				НоваяЗапись.Дисциплина = Объект.Дисциплина;
				НоваяЗапись.ДЗ = Объект.ДомашнееЗадание;
				//НоваяЗапись.КоличествоЧасов = Объект.КоличествоЧасов;
				//НоваяЗапись.КОплате = Объект.Итого;
			//КонецЕсли;
		КонецЕсли;
		
		НаборЗаписейДЗ.Записать();
КонецПроцедуры


&НаКлиенте
Процедура НесколькоГруппПриИзменении(Элемент)
	Если Объект.НесколькоГрупп=Истина тогда
		Объект.КоличествоГрупп="";
		Элементы.ГруппыТЧ.Видимость=Истина;
		Элементы.Группа.Доступность=ложь;
		Объект.КоличествоГрупп=Объект.Группа;
	Иначе
		Элементы.ГруппыТЧ.Видимость=Ложь;
		Объект.КоличествоГрупп="";
		Элементы.Группа.Доступность=Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуТовара(Дата,УчГод, Группа, Дисциплина, НаЧтоЗапланированы)
    
	Отбор = Новый Структура("УчГод,Группа,Дисциплина,НаЧтоЗапланированы", УчГод,Группа,Дисциплина,НаЧтоЗапланированы);
	ЦенаТовара = РегистрыСведений.ПланПоЧасам.ПолучитьПоследнее(Дата,Отбор);
	Возврат ЦенаТовара.КоличествоЧасов;
	    
КонецФункции


&НаКлиенте
Процедура ГруппыТЧГруппаПриИзменении(Элемент)

	ТЧ=Элементы.ГруппыТЧ.ТекущиеДанные;
	НомерГруппы=ТЧ.Группа;
	ТЧ.КоличествоЧасов = ПолучитьЦенуТовара(ТекущаяДата(),Объект.ОплатаЗаПериод, ТЧ.Группа, Объект.Дисциплина, Объект.ВидЗанятия);
	ГруппаНаСервере();
	

КонецПроцедуры

