
&НаСервере
Процедура ПриОткрытииНаСервере()
	Счет = 1;
Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	Студенты.Ссылка КАК Студент,
        |	Студенты.Код КАК НовыйКод
        |ИЗ
        |	Справочник.Студенты КАК Студенты";	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Объект.Студенты.Загрузить(РезультатЗапроса);
	
	
	//Студент = Справочники.Студенты.Получить;
	//
	//Счет = 1;
	Для Каждого С Из Объект.Студенты Цикл
		
		С.НовыйКод = Счет;
		Счет = Счет +1;
		//С.Записать();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
