
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ТекДата = НачалоДня(ТекущаяДата());
    НаборЗаписей = РегистрыСведений.ПланПоЧасам.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Группа.Установить(ТекущийОбъект.Ссылка);
    НаборЗаписей.Прочитать();

    Для Каждого СтрокаТаблицы Из ТекущийОбъект.ЧасыИтоговые Цикл
        НоваяЗапись = НаборЗаписей.Добавить();

        НоваяЗапись.Период = СтрокаТаблицы.ДатаНачала+1;
        НоваяЗапись.Группа = ТекущийОбъект.Ссылка;
        НоваяЗапись.НаЧтоЗапланированы = СтрокаТаблицы.НаЧтоЗапланированыЧасы; 
		НоваяЗапись.КоличествоЧасов = СтрокаТаблицы.СколькоЧасов;

     КонецЦикла;

    Если НаборЗаписей.Количество() > 0 Тогда
        НаборЗаписей.Записать();
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриПовторномОткрытииНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланПоЧасам.Период КАК ДатаНачала,
		|	ПланПоЧасам.КоличествоЧасов КАК СколькоЧасов,
		|	ПланПоЧасам.НаЧтоЗапланированы КАК НаЧтоЗапланированыЧасы
		|ИЗ
		|	РегистрСведений.ПланПоЧасам КАК ПланПоЧасам
		|ГДЕ
		|	ПланПоЧасам.Группа = &Группа";
	
	Запрос.УстановитьПараметр("Группа", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.ЧасыИтоговые.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ПриПовторномОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриПовторномОткрытииНаСервере();
КонецПроцедуры
